{
  "RESUME": "Resume",
  "LANG": "Español",
  "AGE": " years old",
  "GRADE": {
    "TITLE": "Completed a degree as a Systems University Analyst at the National University of Rosario.",
    "DESCRIPTION": "Versed in numerous languages including C, C#, Java, JavaScript, TypeScript, HTML, CSS, SQL."
  },
  "KNOWLEDGE": {
    "TITLE": "Knowledge areas",
    "ITEMS": [
      "Frontend developer with Angular 2+, AngularJs, React.",
      "Backend developer with Spring-Boot, LoopBack, Strapi.",
      "Regular use of Docker.",
      "Experience developing Android (Android Studio and Nativescript).",
      "PostgreSQL, MySQL, MongoDB"
    ],
    "CHIPS": [
      "Angular",
      "Javascript",
      "Rxjs",
      "Bootstrap",
      "Tailwind",
      "Jest",
      "Karma",
      "ESLint",
      "Prettier",
      "Spring-Boot",
      "Docker",
      "PostgreSQL",
      "MySql",
      "MongoDB",
      "Linux",
      "Git"
    ]
  },
  "EXPERIENCE": {
    "TITLE": "Professional experience",
    "LIST": [
      {
        "START": "Julio 2025",
        "TITLE": "Globant",
        "DESCRIPTION": "I participated in the development of a front-end backoffice for the company COTO, using Angular 19. We implemented the Signals API, ensured code quality with tools like SonarQube, Prettier, and ESLint, and developed automated tests with Jest.",
        "LINK": "https://globant.com"
      },
      {
        "START": "Septiembre 2024",
        "TITLE": "Globant",
        "DESCRIPTION": "I worked on the development and maintenance of a front-end backoffice for AES Corporation, specifically within the inventory management module. My main focus was on refactoring legacy code.",
        "LINK": "https://globant.com"
      },
      {
        "START": "November 2023",
        "TITLE": "Globant",
        "DESCRIPTION": "Worked as a frontend developer using Angular for GDN company, in a team of around 15 people. The project focused on enabling users to accumulate points with their supermarket purchases, which would later be redeemed for various rewards and benefits.",
        "LINK": "https://globant.com"
      },
      {
        "START": "July 2022",
        "TITLE": "Likida",
        "DESCRIPTION": "Likida was a startup aiming to create a platform for buying, selling, lending, and auctioning NFTs. I worked on developing both the backend and frontend of the application, collaborating with an NFT specialist. The technologies used included Angular for the frontend and Strapi, a JavaScript-based backend.",
        "LINK": "https://likida.io/"
      },

      {
        "START": "November 2020",
        "TITLE": "Mangoo Dev",
        "DESCRIPTION": "I have been working in diverse teams for each project, applying agile development methodologies. In these projects, my role focuses solely on development, including front-end development using Angular and React, as well as back-end development in Java with Spring-Boot.",
        "LINK": "https://mangoodev.com/"
      },

      {
        "START": "July 2019",
        "TITLE": "TuCuotaOnline",
        "DESCRIPTION": "Collaborating with a small startup team to develop an Angular web application capable of processing and managing loans online.",
        "LINK": "https://tucuota.online/"
      },

      {
        "START": "October 2018",
        "TITLE": "Tux Solutions",
        "DESCRIPTION": "Developed multiple web applications in Angular, all containerized with Docker on a server with configured CI/CD. Responsibilities included maintaining code, implementing new functionalities in both the frontend and backend. Engaged in direct communication with customers, providing support, and understanding their needs.",
        "LINK": "https://tux-solutions.com/"
      },

      {
        "START": "February 2018",
        "TITLE": "Jubbler Technologies",
        "DESCRIPTION": "Provided support to various companies using VisualFox for their ERPs on that platform.",
        "LINK": "https://jubbler.tech/"
      }
    ]
  },
  "LANGUAGES": {
    "TITLE": "Languages",
    "DESCRIPTION": "English (advanced), Spanish (native)."
  },
  "HOBBIES": {
    "TITLE": "Hobbies",
    "LIST": [
      "In my free time, I engage in hobbyist video game development.",
      "I have a passion for drawing and creating 2D animations.",
      "I have a web server set up on a Raspberry Pi 3, running Alpine Linux as the operating system. The server utilizes Docker with Nginx and a reverse proxy."
    ]
  }
}
